Meshes & Solutions/blockgen-16/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       3800;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       3860;
    }
    polygon
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       3920;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          2000;
        startFace       4080;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          2000;
        startFace       6080;
    }
    outside
    {
        type            patch;
        nFaces          120;
        startFace       8080;
    }
)

// ************************************************************************* //
